In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("Country GDP by year in USD 1960 to 2015.csv")

In [3]:
data = data.melt(col_level=0, id_vars=["Country Name", "Country Code"])

In [4]:
data

           Country Name Country Code variable         value
0                 Aruba          ABW     1960           NaN
1               Andorra          AND     1960           NaN
2           Afghanistan          AFG     1960  5.377778e+08
3                Angola          AGO     1960           NaN
4               Albania          ALB     1960           NaN
...                 ...          ...      ...           ...
14779       Yemen, Rep.          YEM     2015           NaN
14780      South Africa          ZAF     2015  3.127980e+11
14781  Congo, Dem. Rep.          COD     2015  3.523774e+10
14782            Zambia          ZMB     2015  2.120156e+10
14783          Zimbabwe          ZWE     2015  1.389294e+10

[14784 rows x 4 columns]

In [5]:
data = data[data['value'].notna()]

In [6]:
data

           Country Name Country Code variable         value
2           Afghanistan          AFG     1960  5.377778e+08
11            Australia          AUS     1960  1.856759e+10
12              Austria          AUT     1960  6.592694e+09
14              Burundi          BDI     1960  1.960000e+08
15              Belgium          BEL     1960  1.165872e+10
...                 ...          ...      ...           ...
14778             Samoa          WSM     2015  7.610379e+08
14780      South Africa          ZAF     2015  3.127980e+11
14781  Congo, Dem. Rep.          COD     2015  3.523774e+10
14782            Zambia          ZMB     2015  2.120156e+10
14783          Zimbabwe          ZWE     2015  1.389294e+10

[11214 rows x 4 columns]

In [11]:
gdp = data

In [12]:
csv = "obesity-cleaned.csv"

In [13]:
obesity_df = pd.read_csv(csv)

In [14]:
obesity_df

       Unnamed: 0      Country  Year       Obesity (%)         Sex
0               0  Afghanistan  1975     0.5 [0.2-1.1]  Both sexes
1               1  Afghanistan  1975     0.2 [0.0-0.6]        Male
2               2  Afghanistan  1975     0.8 [0.2-2.0]      Female
3               3  Afghanistan  1976     0.5 [0.2-1.1]  Both sexes
4               4  Afghanistan  1976     0.2 [0.0-0.7]        Male
...           ...          ...   ...               ...         ...
24565       24565     Zimbabwe  2015     4.5 [2.4-7.6]        Male
24566       24566     Zimbabwe  2015  24.8 [18.9-31.3]      Female
24567       24567     Zimbabwe  2016  15.5 [12.0-19.2]  Both sexes
24568       24568     Zimbabwe  2016     4.7 [2.5-8.0]        Male
24569       24569     Zimbabwe  2016  25.3 [19.1-32.0]      Female

[24570 rows x 5 columns]

In [15]:
obesity_df = obesity_df.drop(columns=['Unnamed: 0'])

In [16]:
obesity_df.rename(columns={'Obesity (%)' : 'Obesity_percentage'}, inplace=True)

In [17]:
obesity_df['Obesity_percentage'] = obesity_df['Obesity_percentage'].apply(lambda x: (x.split()[0]))

In [18]:
clean_df = obesity_df[obesity_df["Obesity_percentage"] != "No"]

In [19]:
clean_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24066 entries, 0 to 24569
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Country             24066 non-null  object
 1   Year                24066 non-null  int64
 2   Obesity_percentage  24066 non-null  object
 3   Sex                 24066 non-null  object
dtypes: int64(1), object(3)
memory usage: 940.1+ KB

In [20]:
clean_df['Obesity_percentage'] = clean_df['Obesity_percentage'].apply(lambda x: float(x))

In [21]:
clean_df.head()

       Country  Year  Obesity_percentage         Sex
0  Afghanistan  1975                 0.5  Both sexes
1  Afghanistan  1975                 0.2        Male
2  Afghanistan  1975                 0.8      Female
3  Afghanistan  1976                 0.5  Both sexes
4  Afghanistan  1976                 0.2        Male

In [22]:
clean_df = clean_df.loc[clean_df['Sex'] == 'Both sexes']

In [23]:
clean_df.head()

        Country  Year  Obesity_percentage         Sex
0   Afghanistan  1975                 0.5  Both sexes
3   Afghanistan  1976                 0.5  Both sexes
6   Afghanistan  1977                 0.6  Both sexes
9   Afghanistan  1978                 0.6  Both sexes
12  Afghanistan  1979                 0.6  Both sexes

In [26]:
clean_df['Country'].nunique()

191

In [27]:
gdp['Country Name'].nunique()

252

In [28]:
gdp.rename(columns = {"Country Name" : "Country"}, inplace = True)

In [29]:
gdp

                Country Country Code variable         value
2           Afghanistan          AFG     1960  5.377778e+08
11            Australia          AUS     1960  1.856759e+10
12              Austria          AUT     1960  6.592694e+09
14              Burundi          BDI     1960  1.960000e+08
15              Belgium          BEL     1960  1.165872e+10
...                 ...          ...      ...           ...
14778             Samoa          WSM     2015  7.610379e+08
14780      South Africa          ZAF     2015  3.127980e+11
14781  Congo, Dem. Rep.          COD     2015  3.523774e+10
14782            Zambia          ZMB     2015  2.120156e+10
14783          Zimbabwe          ZWE     2015  1.389294e+10

[11214 rows x 4 columns]

In [69]:
gdp['variable'].dropna()

2        1960
11       1960
12       1960
14       1960
15       1960
         ...
14778    2015
14780    2015
14781    2015
14782    2015
14783    2015
Name: variable, Length: 11214, dtype: object

In [71]:
gdp['variable'].unique()

array(['1960', '1961', '1962', '1963', '1964', '1965', '1966', '1967',
       '1968', '1969', '1970', '1971', '1972', '1973', '1974', '1975',
       '1976', '1977', '1978', '1979', '1980', '1981', '1982', '1983',
       '1984', '1985', '1986', '1987', '1988', '1989', '1990', '1991',
       '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999',
       '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007',
       '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015'],
      dtype=object)

In [75]:
gdp['variable'] = gdp['variable'].astype(int)

In [76]:
cleaned_gdp = gdp.loc[gdp['variable'] >= 1975]

In [78]:
cleaned_gdp

                    Country Country Code  variable         value
3961                Andorra          AND      1975  2.201129e+08
3962            Afghanistan          AFG      1975  2.366667e+09
3965             Arab World          ARB      1975  1.156690e+11
3966   United Arab Emirates          ARE      1975  1.472067e+10
3967              Argentina          ARG      1975  5.243865e+10
...                     ...          ...       ...           ...
14778                 Samoa          WSM      2015  7.610379e+08
14780          South Africa          ZAF      2015  3.127980e+11
14781      Congo, Dem. Rep.          COD      2015  3.523774e+10
14782                Zambia          ZMB      2015  2.120156e+10
14783              Zimbabwe          ZWE      2015  1.389294e+10

[8964 rows x 4 columns]

In [79]:
cleaned_gdp = cleaned_gdp.copy()

In [83]:
cleaned_gdp.rename(columns = {"variable" : "Year"}, inplace = True)

In [84]:
clean_df = clean_df.copy()

In [85]:
merged_df = clean_df.merge(cleaned_gdp, on=["Country", "Year"], how="right")

In [86]:
merged_df

,Country,Year,Obesity_percentage,Sex,Country Code,value
0,Afghanistan,1975,0.5,Both sexes,AFG,2.366667e+09
1,Afghanistan,1976,0.5,Both sexes,AFG,2.555556e+09
2,Afghanistan,1977,0.6,Both sexes,AFG,2.953333e+09
3,Afghanistan,1978,0.6,Both sexes,AFG,3.300000e+09
4,Afghanistan,1979,0.6,Both sexes,AFG,3.697940e+09
...,...,...,...,...,...,...
8959,St. Vincent and the Grenadines,2015,NaN,NaN,VCT,7.513733e+08
8960,Vietnam,2015,NaN,NaN,VNM,1.935990e+11
8961,West Bank and Gaza,2015,NaN,NaN,PSE,1.267740e+10
8962,World,2015,NaN,NaN,WLD,7.343360e+13
8963,"Congo, Dem. Rep.",2015,NaN,NaN,COD,3.523774e+10